#### Terraform Format and Style 🖌``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Complete MySQL example security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "complete-mysql-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + tags_all               = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.99.0.0/18",
        ]
      + description              = "MySQL access from within VPC"
      + from_port                = 3306
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn         = (known after apply)
      + description = "Database subnet group for complete-mysql"
      + id          = (known after apply)
      + name        = "complete-mysql"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + tags_all    = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + tags_all = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1a"
          + "Owner"       = "secops"
        }
      + tags_all         = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1a"
          + "Owner"       = "secops"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1b"
          + "Owner"       = "secops"
        }
      + tags_all         = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1b"
          + "Owner"       = "secops"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1c"
          + "Owner"       = "secops"
        }
      + tags_all         = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1c"
          + "Owner"       = "secops"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public"
          + "Owner"       = "secops"
        }
      + tags_all         = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public"
          + "Owner"       = "secops"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.7.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1a"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1a"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.8.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1b"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1b"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.9.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1c"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-db-ap-south-1c"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1a"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1a"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1b"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1b"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1c"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-private-ap-south-1c"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1a"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1a"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1b"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1b"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-south-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.99.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1c"
          + "Owner"       = "secops"
        }
      + tags_all                        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql-public-ap-south-1c"
          + "Owner"       = "secops"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.99.0.0/18"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
      + tags_all                         = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
        }
    }

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 30
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_window                         = "03:00-06:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + enabled_cloudwatch_logs_exports       = [
          + "general",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.20"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "complete-mysql"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:00:00-mon:03:00"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = "completeMysql"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = true
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "high"
        }
      + tags_all                              = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "high"
        }
      + timezone                              = (known after apply)
      + username                              = "complete_mysql"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {
          + create = "40m"
          + delete = "40m"
          + update = "80m"
        }
    }

  # module.db.module.db_option_group.aws_db_option_group.this[0] will be created
  + resource "aws_db_option_group" "this" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = (known after apply)
      + name_prefix              = "complete-mysql-"
      + option_group_description = "complete-mysql option group"
      + tags                     = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "low"
        }
      + tags_all                 = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "low"
        }

      + timeouts {
          + delete = "15m"
        }
    }

  # module.db.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "complete-mysql parameter group"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "complete-mysql-"
      + tags        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "low"
        }
      + tags_all    = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "low"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
    }

  # module.db.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "complete-mysql subnet group"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "complete-mysql-"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "high"
        }
      + tags_all    = {
          + "Environment" = "honeypot"
          + "Name"        = "complete-mysql"
          + "Owner"       = "secops"
          + "Sensitive"   = "high"
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + db_default_instance_address           = ""
  + db_default_instance_arn               = ""
  + db_default_instance_availability_zone = ""
  + db_default_instance_endpoint          = ""
  + db_default_instance_hosted_zone_id    = ""
  + db_default_instance_id                = ""
  + db_default_instance_name              = ""
  + db_default_instance_password          = (sensitive value)
  + db_default_instance_port              = ""
  + db_default_instance_resource_id       = ""
  + db_default_instance_status            = ""
  + db_default_instance_username          = (sensitive value)
  + db_default_parameter_group_arn        = ""
  + db_default_parameter_group_id         = ""
  + db_default_subnet_group_arn           = ""
  + db_default_subnet_group_id            = ""
  + db_enhanced_monitoring_iam_role_arn   = ""
  + db_instance_address                   = (known after apply)
  + db_instance_arn                       = (known after apply)
  + db_instance_availability_zone         = (known after apply)
  + db_instance_endpoint                  = (known after apply)
  + db_instance_hosted_zone_id            = (known after apply)
  + db_instance_id                        = (known after apply)
  + db_instance_name                      = "completeMysql"
  + db_instance_password                  = (sensitive value)
  + db_instance_port                      = 3306
  + db_instance_resource_id               = (known after apply)
  + db_instance_status                    = (known after apply)
  + db_instance_username                  = (sensitive value)
  + db_parameter_group_arn                = (known after apply)
  + db_parameter_group_id                 = (known after apply)
  + db_subnet_group_arn                   = (known after apply)
  + db_subnet_group_id                    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @indercodes, Action: `pull_request`*